src/Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ХранилищеДополнительнойИнформации</Name>
			<Comment>Хранилище дополнительной информации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Comment>Вид данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительнойИнформацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросКаталога</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееИзвещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийКаталогТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееИзвещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийРеджектАкцептСчетаФактуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийАкцептСчетаФактуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийРеджектАкцептЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийАкцептНакладной</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросПрайсЛиста</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийРеджектАкцептНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийСчетФактура</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийКаталогТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийРеджектЗаказа</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПрайсЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗапросКаталога</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийАкцептЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийТоварКРаботе</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийТоварКРаботе</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийРеджектСчетаФактуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийСчетФактура</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийРеджектНакладной</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПрайсЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗапросПрайсЛиста</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/РаботаСФайламиПереопределяемый/Ext/Module.bsl
#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура ПередОткрытиемФормыЭлементаДополнительно(Форма, ДополнительныеДействия, НазначаемыеДействия = Неопределено) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействияФормыЭлемента(Элемент, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ОбновитьПредставлениеЭлемента(ИмяОбновляемогоЭлемента, Форма, Ссылка) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнительноеДействиеПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ПередЗаписьюФормыЭлементаДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнитьСтруктуруДляСпискаДополнительныхФайлов(Форма, СтруктураДляСпискаДополнительныхФайлов) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ФАЙЛАМИ РЕЗЮМЕ

Процедура ПередОткрытиемФормыСпискаФайловИзображений(Форма, ВладелецФормы, ДополнительныеДействия) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействия(Кнопка, Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ДополнительныеФайлыПриПолученииДанныхДополнительно(Форма, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено

КонецПроцедуры

Процедура ОбработчикОжиданияФайлыПриАктивизацииСтрокиДополнительно(Форма) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Функция ДобавитьПрикрепленныеФайлы(ОбъектСсылка, ЗаголовокОкна) Экспорт
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Заголовок = ЗаголовокОкна;
	ДиалогОткрытияФайла.Фильтр = РаботаСФайлами.ПолучитьФильтрФайлов();
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	
	ДобавленныеФайлы = Новый Массив;

	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат ДобавленныеФайлы;
	КонецЕсли;  
	
	Для Каждого ВыбранныйФайл Из ДиалогОткрытияФайла.ВыбранныеФайлы Цикл
		
		ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(ВыбранныйФайл);
		
		Если РаботаСФайлами.ФайлИмеетРасширениеИзображения(ИмяФайла) Тогда
			ЗначениеХранилища = Новый Картинка(ВыбранныйФайл);
			ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
		Иначе
			ЗначениеХранилища = Новый ДвоичныеДанные(ВыбранныйФайл);
			ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
		КонецЕсли;
		
		НовыйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
		НовыйФайл.Хранилище		= Новый ХранилищеЗначения(ЗначениеХранилища, Новый СжатиеДанных);
		НовыйФайл.Наименование	= ИмяФайла;
		НовыйФайл.Объект		= ОбъектСсылка;
		НовыйФайл.ИмяФайла		= ИмяФайла;
		НовыйФайл.ВидДанных		= ВидДанных;
		НовыйФайл.Записать();
		
		ДобавленныеФайлы.Добавить(НовыйФайл.Ссылка);
	
	КонецЦикла;

	Возврат ДобавленныеФайлы;
	
КонецФункции

#КонецЕсли
